NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20b/nrf54lm20b_flpr.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_USBHSCORE_NS</name>
      <description>USBHSCORE 0</description>
      <baseAddress>0x40020000</baseAddress>
      <headerStructName>USBHSCORE</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x24000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>USBHSCORE</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>GOTGCTL</name>
          <description>Control and Status Register</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x000D0000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VBVALIDOVEN</name>
              <description>Mode: Host only. VBUS Valid Override Enable (VbvalidOvEn)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Override is disabled and bvalid signal from the respective PHY selected is used internally by the controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The vbus-valid signal received from the PHY is overridden with GOTGCTL.VbvalidOvVal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBVALIDOVVAL</name>
              <description>Mode: Host only. VBUS Valid OverrideValue (VbvalidOvVal)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET0</name>
                  <description>vbusvalid value when GOTGCTL.VbvalidOvEn = 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET1</name>
                  <description>vbusvalid value when GOTGCTL.VbvalidOvEn is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVALIDOVEN</name>
              <description>Mode: Host only. A-Peripheral Session Valid Override Enable (AvalidOvEn)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Derive AValid from PHY</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Derive Avalid from GOTGCTL.AvalidOvVal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVALIDOVVAL</name>
              <description>Mode: Host only. A-Peripheral Session Valid OverrideValue (AvalidOvVal)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE0</name>
                  <description>Avalid value is 1'b0 when GOTGCTL.AvalidOvEn =1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE1</name>
                  <description>Avalid value is 1'b1 when GOTGCTL.AvalidOvEn =1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BVALIDOVEN</name>
              <description>Mode: Device only. B-Peripheral Session Valid Override Value (BvalidOvEn)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Override is disabled and bvalid signal from the respective PHY selected is used internally by the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Internally Bvalid received from the PHY is overridden with GOTGCTL.BvalidOvVal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BVALIDOVVAL</name>
              <description>Mode: Device only. B-Peripheral Session Valid OverrideValue (BvalidOvVal)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE0</name>
                  <description>Bvalid value when GOTGCTL.BvalidOvEn =1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE1</name>
                  <description>Bvalid value when GOTGCTL.BvalidOvEn =1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBNCEFLTRBYPASS</name>
              <description>Mode: Host and Device. Debounce Filter Bypass</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Debounce Filter Bypass is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Debounce Filter Bypass is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONIDSTS</name>
              <description>Mode: Host and Device. Connector ID Status (ConIDSts)</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODEA</name>
                  <description>The core is in A-Device mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODEB</name>
                  <description>The core is in B-Device mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBNCTIME</name>
              <description>Mode: Host only. Long/Short Debounce Time (DbncTime)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LONG</name>
                  <description>Long debounce time, used for physical connections (100 ms + 2.5 micro-sec)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHORT</name>
                  <description>Short debounce time, used for soft connections (2.5 micro-sec)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASESVLD</name>
              <description>Mode: Host only. A-Session Valid (ASesVld)</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVALID</name>
                  <description>A-session is not valid.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>A-session is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSESVLD</name>
              <description>Mode: Device only. B-Session Valid (BSesVld)</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVALID</name>
                  <description>B-session is not valid.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>B-session is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTGVER</name>
              <description>OTG Version (OTGVer)</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VER13</name>
                  <description>Supports OTG Version 1.3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VER20</name>
                  <description>Supports OTG Version 2.0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURMOD</name>
              <description>Current Mode of Operation (CurMod)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEVICEMODE</name>
                  <description>Current mode is device mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTMODE</name>
                  <description>Current mode is host mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTVALIDBC</name>
              <description>Mode: Host and Device. Multi Valued ID pin (MultValIdBC)</description>
              <lsb>22</lsb>
              <msb>26</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIDC</name>
                  <description>B-Device connected to ACA. VBUS is on.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIDB</name>
                  <description>B-Device connected to ACA. VBUS is off.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIDA</name>
                  <description>A-Device connected to ACA</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIDGND</name>
                  <description>A-Device not connected to ACA</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIDFLOAT</name>
                  <description>B-Device not connected to ACA</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHIRPEN</name>
              <description>Mode: Device Only. This bit when programmed to 1'b1 results in the core asserting chirp_on before sending an actual Chirp 'K' signal on USB. This bit is present only if OTG_BC_SUPPORT = 1.If OTG_BC_SUPPORT!=1, this bit is a reserved bit. Do not set this bit when core is operating in HSIC mode because HSIC always operates at High Speed and High speed chirp is not used</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHIRPDISABLE</name>
                  <description>The controller does not assert chirp_on before sending an actual Chirp 'K' signal on USB.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIRPENABLE</name>
                  <description>The controller asserts chirp_on before sending an actual Chirp 'K' signal on USB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EUSB2PHYDISCSUPP</name>
              <description>This field is only applicable to Device mode and must be set to 1'b1 if eUSB2 PHY is used.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Device disconnect detection using GINTSTS.USBRst interrupt when not in hibernation and GPWRDN.ResetDetected when in hibernation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Device disconnect detection using GOTGINT.SesEEndDet interrupt when not in hibernation and GPWRDN.StsChngInt when in hibernation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GOTGINT</name>
          <description>Interrupt Register</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SESENDDET</name>
              <description>Mode: Host and Device. Session End Detected (SesEndDet)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Session is Active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>SessionEnd utmiotg_bvalid signal is deasserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESREQSUCSTSCHNG</name>
              <description>Mode: Host and Device. Session Request Success Status Change (SesReqSucStsChng)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Change in Session Request Status</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Session Request Status has changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSTNEGSUCSTSCHNG</name>
              <description>Mode: Host and Device. Host Negotiation Success Status Change (HstNegSucStsChng)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Change</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Host Negotiation Status Change</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSTNEGDET</name>
              <description>Mode:Host and Device. Host Negotiation Detected (HstNegDet)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Active HNP Request</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Active HNP request detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADEVTOUTCHG</name>
              <description>Mode: Host and Device. A-Device Timeout Change (ADevTOUTChg)</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No A-Device Timeout</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>A-Device Timeout</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBNCEDONE</name>
              <description>Mode: Host only. Debounce Done (DbnceDone)</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>After Connect waiting for Debounce to complete</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Debounce completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTVALIPCHNG</name>
              <description>This bit when set indicates that there is a change in the value of at least one ACA pin value.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACAPINCHANGE</name>
                  <description>Indicates there is no change in ACA pin value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACAPINCHANGE</name>
                  <description>Indicates there is a change in ACA pin value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
