NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20b/nrf54lm20b_flpr.svd
        <register>
          <name>TIMING</name>
          <description>Timing</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RU</name>
              <description>Ramp-up time</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Legacy</name>
                  <description>Legacy ramp-up time</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Fast</name>
                  <description>Fast ramp-up (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY</name>
          <description>Frequency</description>
          <addressOffset>0x708</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz).</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>MAP</name>
              <description>Channel map selection. 0: Channel map between 2400 MHZ to 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1: Channel map between 2360 MHZ to 2460 MHz, Frequency = 2360 + FREQUENCY (MHz).</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOWER</name>
          <description>Output power</description>
          <addressOffset>0x710</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000013</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXPOWER</name>
              <description>RADIO output power</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MaxdBm</name>
                  <description>+8 dBm</description>
                  <value>0x03F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos8dBm</name>
                  <description>+8 dBm</description>
                  <value>0x03F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos7dBm</name>
                  <description>+7 dBm</description>
                  <value>0x039</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos6dBm</name>
                  <description>+6 dBm</description>
                  <value>0x033</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos5dBm</name>
                  <description>+5 dBm</description>
                  <value>0x02D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos4dBm</name>
                  <description>+4 dBm</description>
                  <value>0x028</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos3dBm</name>
                  <description>+3 dBm</description>
                  <value>0x023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos2dBm</name>
                  <description>+2 dBm</description>
                  <value>0x01F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos1dBm</name>
                  <description>+1 dBm</description>
                  <value>0x01B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0dBm</name>
                  <description>0 dBm</description>
                  <value>0x018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg1dBm</name>
                  <description>-1 dBm</description>
                  <value>0x015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg2dBm</name>
                  <description>-2 dBm</description>
                  <value>0x013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg3dBm</name>
                  <description>-3 dBm</description>
                  <value>0x011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg4dBm</name>
                  <description>-4 dBm</description>
                  <value>0x00F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg5dBm</name>
                  <description>-5 dBm</description>
                  <value>0x00D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg6dBm</name>
                  <description>-6 dBm</description>
                  <value>0x00B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg7dBm</name>
                  <description>-7 dBm</description>
                  <value>0x00A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg8dBm</name>
                  <description>-8 dBm</description>
                  <value>0x009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg9dBm</name>
                  <description>-9 dBm</description>
                  <value>0x008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg10dBm</name>
                  <description>-10 dBm</description>
                  <value>0x007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg12dBm</name>
                  <description>-12 dBm</description>
                  <value>0x006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg14dBm</name>
                  <description>-14 dBm</description>
                  <value>0x005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg16dBm</name>
                  <description>-16 dBm</description>
                  <value>0x004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg18dBm</name>
                  <description>-18 dBm</description>
                  <value>0x003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg20dBm</name>
                  <description>-20 dBm</description>
                  <value>0x002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg22dBm</name>
                  <description>-22 dBm</description>
                  <value>0x002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg28dBm</name>
                  <description>-28 dBm</description>
                  <value>0x001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg40dBm</name>
                  <description>-40 dBm</description>
                  <value>0x130</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg46dBm</name>
                  <description>-46 dBm</description>
                  <value>0x110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MindBm</name>
                  <description>Minimum output power</description>
                  <value>0x000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFS</name>
          <description>Interframe spacing in us</description>
          <addressOffset>0x714</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of the first bit of the subsequent packet.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISAMPLE</name>
          <description>RSSI sample</description>
          <addressOffset>0x718</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000007F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSSISAMPLE</name>
              <description>RSSI sample result. The value of this register is read as a positive value while the actual received signal strength is a negative value. Actual received signal strength is therefore as follows: received signal strength = -A dBm.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RXGAIN</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_RXGAIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7D0</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>Override configuration of receiver gain control loop</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x801230C3</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCAAFOVERRIDE</name>
                <description>Override value for AAF</description>
                <lsb>17</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>AGCMIXOVERRIDE</name>
                <description>Override value for MIX</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>AGCLNAOVERRIDE</name>
                <description>Override value for LNA</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>AGCOVERRIDEGAIN</name>
                <description>Enable AGC override</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOverride</name>
                    <description>AGC takes control over all gains</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Override</name>
                    <description>Manual control of AAF, MIX, and LNA gain settings</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FREQFINETUNE</name>
          <description>Fine tuning of the RF frequency</description>
          <addressOffset>0x0804</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQFINETUNE</name>
              <description>Twos-complement number for fine-tuning the frequency. The step size is 488.28125 Hz, giving a range from -1 MHz to (one step short of) +1 MHz.</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FECONFIG</name>
          <description>Config register</description>
          <addressOffset>0x908</addressOffset>
          <access>read-write</access>
          <resetValue>0x10800005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCALERMODE</name>
              <description>Mode for narrow scaling output.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Classic log based scaling mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>LUT based scaling mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFO_STAT</name>
          <description>Carrier freq. offset estimate</description>
          <addressOffset>0xB00</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYNCOK</name>
              <description>SYNC ok</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SyncNotOK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SyncOk</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCCORR</name>
          <description>Correlator thresholds</description>
          <addressOffset>0xB40</addressOffset>
          <access>read-write</access>
          <resetValue>0x1FFFFF90</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TH</name>
              <description>Correlation threshold</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFEMODE</name>
          <description>Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD)</description>
          <addressOffset>0xD00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DFEOPMODE</name>
              <description>Direction finding operation mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Direction finding mode disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoD</name>
                  <description>Direction finding mode set to AoD</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoA</name>
                  <description>Direction finding mode set to AoA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFESTATUS</name>
          <description>DFE status information</description>
          <addressOffset>0xD04</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWITCHINGSTATE</name>
              <description>Internal state of switching state machine</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Switching state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Offset</name>
                  <description>Switching state Offset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Guard</name>
                  <description>Switching state Guard</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref</name>
                  <description>Switching state Ref</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Switching</name>
                  <description>Switching state Switching</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ending</name>
                  <description>Switching state Ending</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLINGSTATE</name>
              <description>Internal state of sampling state machine</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Sampling state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sampling</name>
                  <description>Sampling state Sampling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
